e02/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ro" xml:lang="ro">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hello World din PHP și Docker</title>
<meta name="author" content="Petru Rebeja" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hello World din PHP și Docker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Cuprins</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc094a17">Pregătirea mediului de lucru</a>
<ul>
<li><a href="#org60b1773">Crearea directorului pentru codul-sursă</a></li>
</ul>
</li>
<li><a href="#org3c56fc0">Rulare script</a>
<ul>
<li><a href="#org45be120">Descărcăm imaginea <code>php:8.2-cli</code></a></li>
<li><a href="#orga8f6b23">Creăm un script</a>
<ul>
<li><a href="#orgb56d7af">Verificăm că scriptul a fost creat</a></li>
</ul>
</li>
<li><a href="#orgfd7eea1">Rulăm scriptul într-un container</a></li>
</ul>
</li>
<li><a href="#org28a64ae">Rulare pagnă</a>
<ul>
<li><a href="#org1fa084a">Descărcăm imaginea <code>php:8.2-apache</code></a></li>
<li><a href="#orga92147b">Creăm o pagină</a>
<ul>
<li><a href="#org2e530a9">Verificăm dacă scriptul <code>PHP</code> a fost creat</a></li>
</ul>
</li>
<li><a href="#org1db376c">Creăm fișierul <code>Dockerfile</code></a></li>
<li><a href="#orgda30d8a">Construim imaginea <code>Docker</code> și rulăm aplicația într-un container</a></li>
<li><a href="#org9e02802">Oprim containerul și ștergem imaginea</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgc094a17" class="outline-2">
<h2 id="orgc094a17">Pregătirea mediului de lucru</h2>
<div class="outline-text-2" id="text-orgc094a17">
</div>
<div id="outline-container-org60b1773" class="outline-3">
<h3 id="org60b1773">Crearea directorului pentru codul-sursă</h3>
<div class="outline-text-3" id="text-org60b1773">
<div class="org-src-container">
<pre class="src src-shell">mkdir -p /tmp/tehnologii-web/
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c56fc0" class="outline-2">
<h2 id="org3c56fc0">Rulare script</h2>
<div class="outline-text-2" id="text-org3c56fc0">
</div>
<div id="outline-container-org45be120" class="outline-3">
<h3 id="org45be120">Descărcăm imaginea <code>php:8.2-cli</code></h3>
<div class="outline-text-3" id="text-org45be120">
<div class="org-src-container">
<pre class="src src-shell">docker pull php:8.2-cli
</pre>
</div>
</div>
</div>

<div id="outline-container-orga8f6b23" class="outline-3">
<h3 id="orga8f6b23">Creăm un script</h3>
<div class="outline-text-3" id="text-orga8f6b23">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"&lt;?php echo \"Hello World!\" ?&gt;"</span> &gt; /tmp/tehnologii-web/hw.php
</pre>
</div>
</div>

<div id="outline-container-orgb56d7af" class="outline-4">
<h4 id="orgb56d7af">Verificăm că scriptul a fost creat</h4>
<div class="outline-text-4" id="text-orgb56d7af">
<div class="org-src-container">
<pre class="src src-shell">ls -al /tmp/tehnologii-web/
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfd7eea1" class="outline-3">
<h3 id="orgfd7eea1">Rulăm scriptul într-un container</h3>
<div class="outline-text-3" id="text-orgfd7eea1">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b294bb;">cd</span> /tmp/tehnologii-web/ &amp;&amp; <span style="color: #8abeb7;">\</span>
docker run <span style="color: #8abeb7;">\</span>
       -it <span style="color: #8abeb7;">\</span>
       --rm <span style="color: #8abeb7;">\</span>
       --name my-running-script <span style="color: #8abeb7;">\</span>
       -v <span style="color: #8abeb7;">"$PWD"</span>:/tmp/tehnologii-web <span style="color: #8abeb7;">\</span>
       -w /tmp/tehnologii-web <span style="color: #8abeb7;">\</span>
       php:8.2-cli php hw.php
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org28a64ae" class="outline-2">
<h2 id="org28a64ae">Rulare pagnă</h2>
<div class="outline-text-2" id="text-org28a64ae">
</div>
<div id="outline-container-org1fa084a" class="outline-3">
<h3 id="org1fa084a">Descărcăm imaginea <code>php:8.2-apache</code></h3>
<div class="outline-text-3" id="text-org1fa084a">
<div class="org-src-container">
<pre class="src src-shell">docker pull php:8.2-apache
</pre>
</div>
</div>
</div>

<div id="outline-container-orga92147b" class="outline-3">
<h3 id="orga92147b">Creăm o pagină</h3>
<div class="outline-text-3" id="text-orga92147b">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"&lt;!DOCTYPE html&gt;</span>
<span style="color: #8abeb7;">&lt;html&gt;</span>
<span style="color: #8abeb7;">  &lt;body&gt;</span>
<span style="color: #8abeb7;">    &lt;?php echo \"Hello world!\" ?&gt;</span>
<span style="color: #8abeb7;">  &lt;/body&gt;</span>
<span style="color: #8abeb7;">&lt;/html&gt;</span>
<span style="color: #8abeb7;">"</span> &gt; /tmp/tehnologii-web/index.php
</pre>
</div>
</div>

<div id="outline-container-org2e530a9" class="outline-4">
<h4 id="org2e530a9">Verificăm dacă scriptul <code>PHP</code> a fost creat</h4>
<div class="outline-text-4" id="text-org2e530a9">
<div class="org-src-container">
<pre class="src src-shell">ls -al /tmp/tehnologii-web/
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1db376c" class="outline-3">
<h3 id="org1db376c">Creăm fișierul <code>Dockerfile</code></h3>
<div class="outline-text-3" id="text-org1db376c">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b294bb;">echo</span> <span style="color: #8abeb7;">"FROM php:8.2-apache</span>
<span style="color: #8abeb7;">COPY index.php /var/www/html/</span>
<span style="color: #8abeb7;">"</span> &gt; /tmp/tehnologii-web/Dockerfile
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda30d8a" class="outline-3">
<h3 id="orgda30d8a">Construim imaginea <code>Docker</code> și rulăm aplicația într-un container</h3>
<div class="outline-text-3" id="text-orgda30d8a">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b294bb;">cd</span> /tmp/tehnologii-web/ &amp;&amp; <span style="color: #8abeb7;">\</span>
docker build -t hello-world-php . &amp;&amp; <span style="color: #8abeb7;">\</span>
docker run -d -p 8081:80 --name hw-app-container hello-world-php
</pre>
</div>

<p>
Aplicația <code>PHP</code> poate fi accesată la adresa <a href="http://localhost:8081/">http://localhost:8081/</a>.
</p>
</div>
</div>

<div id="outline-container-org9e02802" class="outline-3">
<h3 id="org9e02802">Oprim containerul și ștergem imaginea</h3>
<div class="outline-text-3" id="text-org9e02802">
<div class="org-src-container">
<pre class="src src-shell">docker stop hw-app-container &amp;&amp; <span style="color: #8abeb7;">\</span>
    docker rm hw-app-container &amp;&amp; <span style="color: #8abeb7;">\</span>
    docker rmi localhost/hello-world-php
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Petru Rebeja</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
